site.org
#+title: Random bits and pieces
#+subtitle: ...about programming, languages, tools, FLOSS software...
#+author: Igor Dejanović
#+hugo_base_dir: .
#+hugo_section: /
#+options: creator:t author:nil

* Open-source
:PROPERTIES:
:CUSTOM_ID: projects
:EXPORT_FILE_NAME: projects
:EXPORT_HUGO_SECTION: /
:EXPORT_HUGO_MENU: :menu main
:END:

Here are short descriptions of some of [[https://en.wikipedia.org/wiki/Free_and_open-source_software][FOSS]] projects I started a while ago. I
use these tools in my work, research and teaching Domain-Specific Languages
course.

** [[https://textx.github.io/textX/][textX]]
:PROPERTIES:
:CUSTOM_ID: textx
:END:
textX is a meta-language (i.e. a language for language definition) for
domain-specific language (DSL) specification in Python inspired by
[[https://eclipse.org/Xtext/][Xtext]].

From a single grammar description textX automatically builds a meta-model (in
the form of Python classes) and a parser for your language. Parser will parse
expressions on your language and automatically build a graph of Python objects
(i.e. the model) corresponding to the meta-model.

Read more information [[https://textx.github.io/textX/][here]] or see the project on [[https://github.com/textX/textX][GitHub]].

** [[https://www.igordejanovic.net/parglare/][parglare]]
Parglare is a modern approach to old-school parsing algorithms - LR and GLR. It
uses integrated scanner (a.k.a scannerless parsing), have an extensive support
for debugging, tracing and visualization. For grammar specification a BNF-like
notation is used.

Read more information [[https://www.igordejanovic.net/parglare/][here]] or see the project on [[https://github.com/igordejanovic/parglare/][GitHub]].

** [[https://textx.github.io/Arpeggio/][Arpeggio]]
:PROPERTIES:
:CUSTOM_ID: arpeggio
:END:
Arpeggio is recursive descent parser with backtracking and memoization (a.k.a.
pacrat parser) for Python. Arpeggio grammars are based on the PEG formalism.
Arpeggio's main use is a foundation for a tool-chain for DSL development but it
can be used for all sort of general purpose parsing.

It is used as a parsing tehnology for textX.

Read more information [[https://textx.github.io/Arpeggio/][here]] or see the project on [[https://github.com/textX/Arpeggio/][GitHub]].

